W7D3/music_app (for W7D3 HW)/app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "year", "band_id", "created_at", "updated_at", "live?") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "pink"], ["year", 2020], ["band_id", 1], ["created_at", "2021-01-06 00:25:53.438104"], ["updated_at", "2021-01-06 00:25:53.438104"], ["live?", true]]
---
    def create
        @album = Album.new(album_params)
         # @album.band_id = params[:band_id]
        # debugger

        if @album.save