W7D3/music_app (for W7D3 HW)/app/views/albums/show.html.erb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<li><%= @album.band_id %></li>
<li><%= Band.find(@album.band_id).name %></li>