W7D3/music_app (for W7D3 HW)/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ed"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, pw)
        user = User.find_by(email: email)